js216/stm32mp135_test_board/baremetal/STM32DDRFW-UTIL/drivers/disco/stm32mp13xx_disco_stpmic1l.c
  return status;
}

uint32_t BSP_PMIC_ReadReg(uint8_t reg, uint8_t *pdata)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->ReadReg(CompObj, reg, pdata);
  if (status != STPMIC1L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

uint32_t BSP_PMIC_WriteReg(uint8_t reg, uint8_t data)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->WriteReg(CompObj, reg, data);
  if (status != STPMIC1L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

uint32_t BSP_PMIC_UpdateReg(uint8_t reg, uint8_t mask)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->UpdateReg(CompObj, reg, mask);
  if (status != STPMIC1L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

/*
 *
 * PMIC registers dump
 *
 */
/* following are configurations */
uint32_t BSP_PMIC_DumpRegs(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->DumpRegs(CompObj);
  if (status != STPMIC1L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return status;
}

/*
 *
 * @brief BSP_PMIC_DDR_Power_Init initialize DDR power
 *
 * DDR power on sequence is:
 * enable VTT_DDR
 * enable VDD_DDR
 *
 * @param  None
 * @retval status
 *
 */
/* following are configurations */
uint32_t BSP_PMIC_DDR_Power_Init()
{
  uint32_t  status = BSP_ERROR_NONE;

  /* VTT_DDR ==> LDO3 ==> 600mV */
  if (BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].control_reg1, MAIN_CR_SNK_SRC) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  /* enable VTT_DDR */
  status = BSP_PMIC_REGU_Set_On(VTT_DDR);
  if (status != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  /* VDD_DDR ==> BUCK2 ==> 1350mV */
  if (BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg1, 0x55) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  return BSP_PMIC_REGU_Set_On(VDD_DDR);
}

uint32_t BSP_PMIC_REGU_Set_On(board_regul_t regu)
{
  uint8_t data;

  switch (regu)
  {
    case VDD:
    case VTT_DDR:
    case VDD3V3_USB:
    case VDD_SD:
    case EN1:
    case EN2:
      /* set enable bit */
      if (BSP_PMIC_UpdateReg(board_regulators_table[regu].control_reg1, MAIN_CR_EN) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_PMIC;
      }
      break;
    case VDDCORE:
    case VDD_DDR:
      /* set enable bit */
      if (BSP_PMIC_UpdateReg(board_regulators_table[regu].control_reg2, MAIN_CR_EN) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_PMIC;
      }
      break;
    default:
      return BSP_ERROR_WRONG_PARAM ;
      break;
  }

  /* Default ramp delay of 1ms */
  HAL_Delay(1);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_REGU_Set_Off(board_regul_t regu)
{
  uint8_t data;

  switch (regu)
  {
    case VDD:
    case VTT_DDR:
    case VDD3V3_USB:
    case VDD_SD:
    case EN1:
    case EN2:
      /* disable ==> clear enable bit */
      if (BSP_PMIC_ReadReg(board_regulators_table[regu].control_reg1,
                           &data) != BSP_ERROR_NONE) /* read control reg to save data */
      {
        return BSP_ERROR_PMIC;
      }

      data &= ~MAIN_CR_EN; /* clear enable bit */
      if (BSP_PMIC_WriteReg(board_regulators_table[regu].control_reg1,
                            data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
      {
        return BSP_ERROR_PMIC;
      }
      break;

    case VDDCORE:
    case VDD_DDR:
      /* disable ==> clear enable bit */
      if (BSP_PMIC_ReadReg(board_regulators_table[regu].control_reg2,
                           &data) != BSP_ERROR_NONE) /* read control reg to save data */
      {
        return BSP_ERROR_PMIC;
      }

      data &= ~MAIN_CR_EN; /* clear enable bit */
      if (BSP_PMIC_WriteReg(board_regulators_table[regu].control_reg2,
                            data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
      {
        return BSP_ERROR_PMIC;
      }
      break;
    default:
      return BSP_ERROR_WRONG_PARAM ;
      break;
  }

  /* Default ramp delay of 1ms */
  HAL_Delay(1);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_DDR_Power_Off()
{
  uint32_t  status = BSP_ERROR_NONE;

  /* disable VTT_DDR */
  status = BSP_PMIC_REGU_Set_Off(VTT_DDR);
  if (status != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  /* disable VDD_DDR */
  return BSP_PMIC_REGU_Set_Off(VDD_DDR);
}

/**
  * @brief  BSP_PMIC_Set_Power_Mode Set PMIC run/low power mode
  * @param  mode  mode to set
  * @retval status
  */

uint32_t BSP_PMIC_Power_Mode_Init()
{
  uint32_t  status = BSP_ERROR_NONE;
  uint8_t TEMP;
  /* Fail-safe overcurrent protection */
  status = BSP_PMIC_WriteReg(FS_OCP_CR1, FS_OCP_BUCK2 | FS_OCP_BUCK1);
  status = BSP_PMIC_WriteReg(FS_OCP_CR2, FS_OCP_LDO3 | FS_OCP_LDO2);


  /* Mask reset LDO control register (LDOS_MRST_CR) for VDD (LDO2) */
  status = BSP_PMIC_WriteReg(LDOS_MRST_CR, LDO2_MRST);


  /* VDDCORE: BUCK1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.25, State=ON_AUTO */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].control_reg1, 0x4B);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);
  /* Add for multiple standby issue */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  BSP_PMIC_ReadReg(BUCK1_PWRCTRL_CR,&TEMP);

  /* VDD_DDR: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.35, State=ON_AUTO */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg1, 0x55);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  /* VDD: LDO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD].control_reg1, \
                             (0x18 << 1) | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD].pwr_control_reg, 0x0);

