js216/stm32mp135_test_board/baremetal/STM32DDRFW-UTIL/drivers/disco/stm32mp13xx_disco_stpmic1l.c
  /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=SINK_SOURCE, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].control_reg1, \
                             MAIN_CR_SNK_SRC | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1, \
                             MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].pwr_control_reg, 0x0);

  /* VDD_SD: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=3.3, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SD].control_reg1, \
                             (0x18 << 1) |  MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SD].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  /* EN1: GPO1, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[EN1].control_reg1, MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[EN1].pwr_control_reg, 0x00);

  /* EN2: GPO2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[EN2].control_reg1, MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[EN2].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  return status;
}

uint32_t BSP_PMIC_Set_Power_Mode(uint32_t mode)
{
  uint32_t  status = BSP_ERROR_NONE;
  uint8_t data,TEMP;

  switch (mode)
  {

    case STPMIC1L_LP_STOP:

    /* VDDCORE: BUCK1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.25, State=ON_AUTO */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg1, 0x4B); 
    status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);

    /* VDD_DDR: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.35, State=ON_AUTO */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg1, 0x55);
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);

    /* VDD: LDO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD].control_reg1, \
                             (0x18 << 1) | MAIN_CR_EN);

    /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].alt_control_reg1, 0x0);

    /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1, \
                             MAIN_CR_EN);

    /* VDD_SD: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=3.3, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SD].alt_control_reg1, \
                             (0x18 << 1) |  MAIN_CR_EN);

    /* EN1: GPO1, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[EN1].control_reg1, MAIN_CR_EN);


    /* EN2: GPO2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[EN2].alt_control_reg1, MAIN_CR_EN);


    /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
    status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
    data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
    status = BSP_PMIC_WriteReg(MAIN_CR, data); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 0 */

    break;


    case STPMIC1L_LPLV_STOP:
    /* VDDCORE: BUCK1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.9, State=ON_AUTO */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg1, 0x28);
    status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg2, \
    	                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);


    /* VDD_DDR: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.35, State=ON_AUTO */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg1, 0x55);
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);
    /* VDD: LDO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD].control_reg1, \
                             (0x18 << 1) | MAIN_CR_EN);

    /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].alt_control_reg1, 0x0);

    /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1, \
                             MAIN_CR_EN);

    /* VDD_SD: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=3.3, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SD].alt_control_reg1, \
                             (0x18 << 1) |  MAIN_CR_EN);

    /* EN1: GPO1, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[EN1].control_reg1, MAIN_CR_EN);


    /* EN2: GPO2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[EN2].alt_control_reg1, MAIN_CR_EN);


    /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
    status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
    data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
    status = BSP_PMIC_WriteReg(MAIN_CR, data); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 0 */

    break;

    case STPMIC1L_STANDBY_DDR_SR:

    /* VDDCORE: BUCK1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg1, 0x0); 
    status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg2, 0x0);


    /* VDD_DDR: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.35, State=ON_AUTO */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg1, 0x55);
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);

    /* VDD: LDO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD].control_reg1, \
                             (0x18 << 1) | MAIN_CR_EN);

