js216/stm32mp135_test_board/baremetal/STM32DDRFW-UTIL/drivers/disco/stm32mp13xx_disco_stpmic1l.c
    /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].alt_control_reg1, 0x0);

    /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1,0x0);

    /* VDD_SD: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SD].alt_control_reg1, 0x0);

    /* EN1: GPO1, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[EN1].control_reg1, MAIN_CR_EN);


    /* EN2: GPO2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[EN2].alt_control_reg1, MAIN_CR_EN);


    /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
    status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
    data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
    status = BSP_PMIC_WriteReg(MAIN_CR, data); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 0 */

    break;

    case STPMIC1L_STANDBY_DDR_OFF:

    /* VDDCORE: BUCK1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg1, 0x0); 
    status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg2, 0x0);


    /* VDD_DDR: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg1, 0x0);
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg2, 0x0);

    /* VDD: LDO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD].control_reg1, \
                             (0x18 << 1) | MAIN_CR_EN);

    /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].alt_control_reg1, 0x0);

    /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1,0x0);

    /* VDD_SD: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SD].alt_control_reg1, 0x0);

    /* EN1: GPO1, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[EN1].control_reg1, MAIN_CR_EN);


    /* EN2: GPO2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    status = BSP_PMIC_WriteReg(board_regulators_table[EN2].alt_control_reg1, MAIN_CR_EN);

    /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
    status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
    data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
    status = BSP_PMIC_WriteReg(MAIN_CR, data| \
                                 STANDBY_PWRCTRL_SEL_1); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 1 */

    break;

    default :
      status = BSP_ERROR_WRONG_PARAM;
  }

  return status;
}

void STPMIC_Enable_Interrupt(PMIC_IRQn IRQn)
{
  uint8_t irq_reg;
  uint8_t irq_reg_value;
  uint8_t mask ;

  if (IRQn >= IRQ_NR)
  {
    return ;
  }

  /* IRQ register is IRQ Number divided by 8 */
  irq_reg = IRQn >> 3 ;

  /* value to be set in IRQ register corresponds to BIT(N) where N is the Interrupt id modulo 8 */
  irq_reg_value = 1 << (IRQn % 8);

  /* Get active mask from register */
  BSP_PMIC_ReadReg(INT_MASK_R1 + irq_reg, &mask);
  mask &=  ~irq_reg_value ;
  /* Clear relevant mask to enable interrupt */
  BSP_PMIC_WriteReg(INT_MASK_R1 + irq_reg, mask);

}

void STPMIC_Disable_Interrupt(PMIC_IRQn IRQn)
{
  uint8_t irq_reg;
  uint8_t irq_reg_value;
  uint8_t mask ;

  if (IRQn >= IRQ_NR)
  {
    return ;
  }

  /* IRQ register is IRQ Number divided by 8 */
  irq_reg = IRQn >> 3 ;

  /* value to be set in IRQ register corresponds to BIT(N) where N is the Interrupt id modulo 8 */
  irq_reg_value = 1 << (IRQn % 8);

  /* Get active mask from register */
  BSP_PMIC_ReadReg(INT_MASK_R1 + irq_reg, &mask);
  mask |=  irq_reg_value ;
  /* Set relevant mask to disable interrupt */
  BSP_PMIC_WriteReg(INT_MASK_R1 + irq_reg, mask);

}


void STPMIC_IrqHandler(void)
{
  uint8_t irq_reg;
  uint8_t mask;
  uint8_t pending_events;
  uint8_t i;

  for (irq_reg = 0 ; irq_reg < STM32_PMIC_NUM_IRQ_REGS ; irq_reg++)
  {
    /* Get pending events & active mask */
    BSP_PMIC_ReadReg(INT_MASK_R1 + irq_reg, &mask);
    BSP_PMIC_ReadReg(INT_PENDING_R1 + irq_reg, &pending_events);
    pending_events &=  ~mask ;

    /* Go through all bits for each register */
    for (i = 0 ; i < 8 ; i++)
    {
      if (pending_events & (1 << i))
      {
        /* Callback with parameter computes as "PMIC Interrupt" enum */
        STPMIC_INTn_Callback((PMIC_IRQn)(irq_reg * 8 + (7 - i)));
      }
    }
    /* Clear events in appropriate register for the event with mask set */
    BSP_PMIC_WriteReg(INT_CLEAR_R1 + irq_reg, pending_events);
  }

}

void STPMIC_Sw_Reset(void)
{
  /* Write 1 in bit 0 of MAIN_CONTROL Register */
  BSP_PMIC_UpdateReg(MAIN_CR, SOFTWARE_SWITCH_OFF_ENABLED);
  return ;
}


__weak void BSP_PMIC_INTn_Callback(PMIC_IRQn IRQn)
{
  switch (IRQn)
  {
    case STPMIC1L_IT_PONKEY_F:
      printf("STPMIC1L_IT_PONKEY_F");
      break;
    case STPMIC1L_IT_PONKEY_R:
      printf("STPMIC1L_IT_PONKEY_R");
      break;
    case STPMIC1L_IT_VINLOW_FA:
      printf("STPMIC1L_IT_VINLOW_FA");
      break;
    case STPMIC1L_IT_VINLOW_RI:
      printf("STPMIC1L_IT_VINLOW_RI");
      break;
    case STPMIC1L_IT_THW_FA:
      printf("STPMIC1L_IT_THW_FA");
      break;
    case STPMIC1L_IT_THW_RI:
      printf("STPMIC1L_IT_THW_RI");
      break;
    case STPMIC1L_IT_BUCK1_OCP:
      printf("STPMIC1L_IT_BUCK1_OCP");
      break;
    case STPMIC1L_IT_BUCK2_OCP:
      printf("STPMIC1L_IT_BUCK2_OCP");
      break;
    case STPMIC1L_IT_LDO2_OCP:
      printf("STPMIC1L_IT_LDO2_OCP");
      break;
    case STPMIC1L_IT_LDO3_OCP:
      printf("STPMIC1L_IT_LDO3_OCP");
      break;
    case STPMIC1L_IT_LDO4_OCP:
      printf("STPMIC1L_IT_LDO4_OCP");
      break;
    case STPMIC1L_IT_LDO5_OCP:
      printf("STPMIC1L_IT_LDO5_OCP");
      break;
    default:
      printf("Unknown IRQ %d", IRQn);
      break;
  }
  printf(" Interrupt received\n\r");
}

void STPMIC_INTn_Callback(PMIC_IRQn IRQn)
{
  BSP_PMIC_INTn_Callback(IRQn);
};
#if 0 /* SBA test */
void BSP_PMIC_INTn_IRQHandler(void)
{
  /*printf("%s:%d\n\r", __FUNCTION__, __LINE__);*/
  /* Call HAL EXTI IRQ Handler to clear appropriate flags */
  HAL_GPIO_EXTI_IRQHandler(PMIC_INTN_PIN);

  STPMIC_IrqHandler();
}
#endif /* 0 */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
